# Automatically generated by nMigen 0.3.dev203+g74fce87. Do not edit.
read_verilog  picorv32.v
read_ilang top.il
# (script_after_read placeholder)
synth_ice40  -top top
# (script_after_synth placeholder)
write_json top.json